app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE (created_at >= '2021-12-14' )
---
    def index
        #Entry.where("created_at >= Date.today")
        @entries = Entry.all

INSERT INTO "entries" ("meal_type", "calories", "proteins", "carbo", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Post Dinner"], ["calories", 23], ["proteins", 21], ["carbo", 1], ["fats", 1], ["created_at", "2021-12-15 04:39:57.592642"], ["updated_at", "2021-12-15 04:39:57.592642"]]
---
    def create
        @entry = Entry.new(entry_params)

        respond_to do |format|
          if @entry.save